Xander-Electronics/ArduinoCore-mbed/boards.txt
MIDIJoker.name=MIDI Joker
MIDIJoker.build.core=arduino
MIDIJoker.build.crossprefix=arduino:arm-none-eabi-
MIDIJoker.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
MIDIJoker.build.variant=MIDIJoker
MIDIJoker.build.mcu=cortex-m4
MIDIJoker.build.extra_flags=
MIDIJoker.build.architecture=cortex-m4
MIDIJoker.build.fpu=-mfpu=fpv4-sp-d16
MIDIJoker.build.float-abi=-mfloat-abi=softfp
MIDIJoker.build.board=ARDUINO_NANO33BLE
MIDIJoker.build.ldscript=linker_script.ld
MIDIJoker.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52840
MIDIJoker.compiler.mbed.defines={build.variant.path}/defines.txt
MIDIJoker.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
MIDIJoker.compiler.mbed.cflags={build.variant.path}/cflags.txt
MIDIJoker.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
MIDIJoker.compiler.mbed.includes={build.variant.path}/includes.txt
MIDIJoker.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
MIDIJoker.compiler.mbed="{build.variant.path}/libs/libmbed.a" "{build.variant.path}/libs/libcc_310_core.a" "{build.variant.path}/libs/libcc_310_ext.a" "{build.variant.path}/libs/libcc_310_trng.a"
MIDIJoker.vid.0=0x2341
MIDIJoker.pid.0=0x005a
MIDIJoker.vid.1=0x2341
MIDIJoker.pid.1=0x805a
MIDIJoker.vid.2=0x2341
MIDIJoker.pid.2=0x015a
MIDIJoker.upload_port.0.vid=0x2341
MIDIJoker.upload_port.0.pid=0x005a
MIDIJoker.upload_port.1.vid=0x2341
MIDIJoker.upload_port.1.pid=0x805a
MIDIJoker.upload_port.2.vid=0x2341
MIDIJoker.upload_port.2.pid=0x015a
MIDIJoker.upload.tool=arduino:bossac
MIDIJoker.upload.tool.default=arduino:bossac
MIDIJoker.upload.protocol=
MIDIJoker.upload.transport=
MIDIJoker.upload.use_1200bps_touch=true
MIDIJoker.upload.wait_for_upload_port=true
MIDIJoker.upload.native_usb=true
MIDIJoker.upload.maximum_size=983040
MIDIJoker.upload.maximum_data_size=262144
MIDIJoker.bootloader.tool=arduino:openocd
MIDIJoker.bootloader.tool.default=arduino:openocd
MIDIJoker.bootloader.extra_action.preflash=echo INFO:removed_mass-erase
MIDIJoker.bootloader.config=-f target/nrf52.cfg
MIDIJoker.bootloader.programmer=-f interface/cmsis-dap.cfg
MIDIJoker.bootloader.file=NINAB306/bootloader.hex
